# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [128, 3, 2]]                     # 0 - P1/2
  - [0, 1, Conv, [128, 3, 2]]                      # 1 - P2/4
  - [1, 2, C3k2, [256, False, 0.25]]               # 2
  - [2, 1, Conv, [256, 3, 2]]                      # 3 - P3/8
  - [3, 1, C2fPSA, [512]]                          # 4 - Spatial attention
  - [4, 1, Conv, [512, 1, 1]]                      # 5 - Projection layer after PSA
  - [5, 1, C3k2, [512, False]]                     # 6 - Additional conv block
  - [6, 1, Conv, [512, 3, 2]]                      # 7 - P4/16
  - [7, 2, C3k2, [512, True]]                      # 8 - Deep P4 processing
  - [8, 1, Conv, [1024, 3, 2]]                     # 9 - P5/32
  - [9, 2, C3k2, [1024, True]]                     # 10
  - [10, 1, SPPF, [1024, 5]]                       # 11
  - [11, 2, C2PSA, [1024]]                         # 12

# YOLO11n head (corrected)
head:
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]     # 13 - Upsample P5→P4
  - [13, 1, DWConv, [512, 3, 1]]                   # 14 - Efficient conv
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]     # 15 - Now upsample to P3 size
  - [[15, 5], 1, Concat, [1]]                      # 16 - P3 Concat
  - [16, 2, C3k2, [256, False]]                    # 17 - P3 block

  - [17, 1, Conv, [256, 3, 2]]                     # 18 - Downsample to P4
  - [[18, 7], 1, Concat, [1]]                      # 19 - P4 mid
  - [19, 2, C3k2, [512, False]]                    # 20

  - [20, 1, Conv, [512, 3, 2]]                     # 21 - Downsample to P5
  - [[21, 12], 1, Concat, [1]]                     # 22 - P5 large
  - [22, 2, C3k2, [1024, True]]                    # 23

  - [[17, 20, 23], 1, Detect, [nc]]                # 24 - Detect(P3, P4, P5)